# ViewShowGrids Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ViewShowGrids Property
ParameterTypeId Class See Also
---
"Show Grids"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ViewShowGrids { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ViewShowGrids As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ViewShowGrids {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace